{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [5, 5], "activity_regularizer": null, "padding": "valid", "data_format": "channels_last", "batch_input_shape": [null, 28, 28, 1], "name": "conv2d_1", "dtype": "float32", "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_constraint": null, "filters": 32}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [5, 5], "activity_regularizer": null, "padding": "same", "data_format": "channels_last", "name": "conv2d_2", "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_constraint": null, "filters": 64}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "units": 1024, "activation": "relu", "kernel_constraint": null, "name": "dense_3"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "units": 10, "activation": "softmax", "kernel_constraint": null, "name": "dense_4"}}], "keras_version": "2.0.6", "backend": "tensorflow"}