{"class_name": "Sequential", "config": [{"class_name": "GRU", "config": {"return_state": false, "activity_regularizer": null, "use_bias": true, "dropout": 0.0, "bias_constraint": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "implementation": 0, "unroll": false, "batch_input_shape": [null, 28, 28], "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "stateful": false, "kernel_constraint": null, "recurrent_constraint": null, "name": "gru_1", "recurrent_regularizer": null, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": false, "bias_regularizer": null, "units": 128, "dtype": "float32", "activation": "tanh", "recurrent_dropout": 0.0}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "units": 10, "activation": "softmax", "kernel_constraint": null, "name": "dense_5"}}], "keras_version": "2.0.6", "backend": "tensorflow"}