{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "kernel_regularizer": null, "trainable": true, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "batch_input_shape": [null, 784], "units": 512, "dtype": "float32", "activation": "sigmoid", "kernel_constraint": null, "name": "dense_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "units": 10, "activation": "softmax", "kernel_constraint": null, "name": "dense_2"}}], "keras_version": "2.0.6", "backend": "tensorflow"}